nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/driver_examples/tpm/simple_pwm/pin_mux.c
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXW70ACxxx
package_id: MCXW70ACMFT
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '45', peripheral: TPM_0, signal: 'CH, 2', pin_signal: PTC7/TRGMUX0_IN3/TRGMUX0_OUT3/SFA0_CLK/TPM0_CH2/SFA1_CLK/CLKOUT/NMI_b, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '39', peripheral: LPUART_1, signal: RX, pin_signal: PTC2/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM4_CH1, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '40', peripheral: LPUART_1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM0_CLKIN, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '25', peripheral: GPIO_D, signal: 'GPIO, 2', pin_signal: ADC0_A14/PTD2/LPTMR0_ALT3/TAMPER0/RF_GPO_5/TPM2_CH0/LPTMR1_TRIG_OUT_b, direction: OUTPUT, gpio_init_state: 'false',
    pull_select: down, pull_enable: disable, pull_value: low, passive_filter: disable, open_drain: disable}
  - {pin_num: '26', peripheral: GPIO_D, signal: 'GPIO, 3', pin_signal: ADC0_A15/PTD3/LPTMR1_ALT3/TAMPER1/RF_GPO_6/TPM2_CH1/TRGMUX0_IN2/LPTMR0_TRIG_OUT_b, direction: OUTPUT,
    gpio_init_state: 'false', pull_select: down, pull_enable: disable, pull_value: low, passive_filter: disable, open_drain: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t port_c2_pin39_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_RX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(PORT_C, 2U, &port_c2_pin39_config);

    const port_pin_config_t port_c3_pin40_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_TX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinConfig(PORT_C, 3U, &port_c3_pin40_config);

    const port_pin_config_t port_c7_pin45_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as TPM0_CH2 */
                                                    .mux = (uint16_t)kPORT_MuxAlt5,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C7 (pin 45) is configured as TPM0_CH2 */
    PORT_SetPinConfig(PORT_C, 7U, &port_c7_pin45_config);

    const port_pin_config_t port_d2_pin25_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as PTD2 */
                                                    .mux = (uint16_t)kPORT_MuxAsGpio,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_D2 (pin 25) is configured as PTD2 */
    PORT_SetPinConfig(PORT_D, 2U, &port_d2_pin25_config);

    const port_pin_config_t port_d3_pin26_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as PTD3 */
                                                    .mux = (uint16_t)kPORT_MuxAsGpio,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_D3 (pin 26) is configured as PTD3 */
    PORT_SetPinConfig(PORT_D, 3U, &port_d3_pin26_config);

    gpio_pin_config_t gpio_d_pin25_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 25)  */
    GPIO_PinInit(GPIO_D, 2U, &gpio_d_pin25_config);

    gpio_pin_config_t gpio_d_pin26_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 26)  */
    GPIO_PinInit(GPIO_D, 3U, &gpio_d_pin26_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
